koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/I2C_STM32F0xx.c
/*
 * Copyright (C) 2017-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: I2C Driver for STMicroelectronics STM32F0xx
 */

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include "I2C_STM32F0xx.h"

#include <string.h>
#include <asm/stm32f0xx.h>
#include <Driver/GPIO_STM32F0xx.h>
#include <Driver/RCC_STM32F0xx.h>

#if defined(USE_I2C1) || defined(USE_I2C2)

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

#define RCC_APB_I2C1_MASK     ((uint32_t)(1U << 21))
#define RCC_APB_I2C2_MASK     ((uint32_t)(1U << 22))

#define T_I2CCLK              125UL // tI2CCLK = 125 ns
#define STD_MODE_SCLL         40UL  // 40*tI2CCLK = 5000 ns
#define STD_MODE_SCLH         32UL  // 32*tI2CCLK = 4000 ns
#define STD_MODE_SDADEL       4UL   // 4*tI2CCLK = 500 ns
#define STD_MODE_SCLDEL       10UL  // 10*tI2CCLK = 1250 ns
#define FST_MODE_SCLL         10UL  // 10*tI2CCLK = 1250 ns
#define FST_MODE_SCLH         4UL   // 4*tI2CCLK = 500 ns
#define FST_MODE_SDADEL       1UL   // 1*tI2CCLK = 125 ns
#define FST_MODE_SCLDEL       4UL   // 4*tI2CCLK = 500 ns

#define I2C_DRV_VERSION DRIVER_VERSION_MAJOR_MINOR(1,0) /* driver version */

/*******************************************************************************
 *  global variable definitions (scope: module-local)
 ******************************************************************************/

/* Driver Version */
static const DRIVER_VERSION DriverVersion = {
  I2C_API_VERSION,
  I2C_DRV_VERSION
};

/* Driver Capabilities */
static const I2C_CAPABILITIES DriverCapabilities = {
  0            /* supports 10-bit addressing */
};

static const GPIO_PIN_CFG_t I2C_pin_cfg_af = {
    GPIO_MODE_AF_OD, GPIO_PULL_DISABLE, GPIO_SPEED_MEDIUM
};

static const GPIO_PIN_CFG_t I2C_pin_cfg_analog = {
    GPIO_MODE_ANALOG, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

#if defined(USE_I2C1)
/* I2C1 Information (Run-Time) */
static I2C_INFO I2C1_Info;

/* I2C1 Resources */
static I2C_RESOURCES I2C1_Resources = {
  I2C1,
  NULL,
  NULL,
  {
      RTE_I2C1_SCL_PORT,
      RTE_I2C1_SCL_PIN,
      RTE_I2C1_SCL_FUNC,
      RTE_I2C1_SDA_PORT,
      RTE_I2C1_SDA_PIN,
      RTE_I2C1_SDA_FUNC,
  },
  I2C1_IRQn,
  RCC_APB_I2C1_MASK,
  &I2C1_Info,
};
#endif /* USE_I2C1 */


#if defined(USE_I2C2)
/* I2C2 Information (Run-Time) */
static I2C_INFO I2C2_Info;

/* I2C2 Resources */
static I2C_RESOURCES I2C2_Resources = {
  I2C2,
  NULL,
  NULL,
  {
      RTE_I2C2_SCL_PORT,
      RTE_I2C2_SCL_PIN,
      RTE_I2C2_SCL_FUNC,
      RTE_I2C2_SDA_PORT,
      RTE_I2C2_SDA_PIN,
      RTE_I2C2_SDA_FUNC,
  },
  I2C2_IRQn,
  RCC_APB_I2C2_MASK,
  &I2C2_Info,
};
#endif /* HAL_I2C2 */

/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

static
uint32_t GetI2CCLK(I2C_RESOURCES *i2c)
{
  uint32_t clk = 0;
  RCC_FREQ_t freq_type = RCC_FREQ_APB;

  if (i2c->reg == I2C1) {
    if ((RCC->CFGR3 & RCC_CFGR3_I2C1SW) != 0)
      freq_type = RCC_FREQ_SYSCLK;
    else
      freq_type = RCC_FREQ_HSI;
  }

  clk = RCC_GetFreq(freq_type) / 1000000;

  return (clk);
}

/**
 * @fn      DRIVER_VERSION I2C_GetVersion(void)
 * @brief   Get driver version.
 * @return  \ref DRIVER_VERSION
 */
static
DRIVER_VERSION I2C_GetVersion(void)
{
  return (DriverVersion);
}

/**
 * @fn      I2C_CAPABILITIES I2C_GetCapabilities(void)
 * @brief   Get driver capabilities.
 * @return  \ref I2C_CAPABILITIES
 */
static
I2C_CAPABILITIES I2C_GetCapabilities(void)
{
  return (DriverCapabilities);
}

/**
 * @fn          int32_t I2Cx_Initialize(I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c)
 * @brief       Initialize I2C Interface.
 * @param[in]   cb_event  Pointer to \ref I2C_SignalEvent
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2Cx_Initialize(I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c)
{
  if (i2c->info->flags & I2C_FLAG_INIT) {
    return (DRIVER_OK);
  }

  I2C_IO *io = &i2c->io;
  I2C_INFO *info = i2c->info;

  /* Configure SCL Pin */
  GPIO_PortClock(io->scl_port, GPIO_PORT_CLK_ENABLE);
  GPIO_PinConfig(io->scl_port, io->scl_pin, &I2C_pin_cfg_af);
  GPIO_AFConfig(io->scl_port, io->scl_pin, io->scl_func);
  /* Configure SDA Pin */
  GPIO_PortClock(io->scl_port, GPIO_PORT_CLK_ENABLE);
  GPIO_PinConfig(io->sda_port, io->sda_pin, &I2C_pin_cfg_af);
  GPIO_AFConfig(io->sda_port, io->sda_pin, io->sda_func);

  /* Reset Run-Time information structure */
  memset(info, 0x00, sizeof(I2C_INFO));

  info->cb_event = cb_event;
  info->flags    = I2C_FLAG_INIT;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2Cx_Uninitialize(I2C_RESOURCES *i2c)
 * @brief       De-initialize I2C Interface.
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2Cx_Uninitialize(I2C_RESOURCES *i2c)
{
  I2C_IO *io = &i2c->io;

  /* Unconfigure SCL Pin */
  GPIO_PinConfig(io->scl_port, io->scl_pin, &I2C_pin_cfg_analog);
  /* Unconfigure SDA Pin */
  GPIO_PinConfig(io->sda_port, io->sda_pin, &I2C_pin_cfg_analog);

  i2c->info->flags = 0U;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2Cx_PowerControl(POWER_STATE state, I2C_RESOURCES *i2c)
 * @brief       Control I2C Interface Power.
 * @param[in]   state   Power state
 * @param[in]   i2c     Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2Cx_PowerControl(POWER_STATE state, I2C_RESOURCES *i2c)
{
  uint32_t cr1;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *reg = i2c->reg;

  switch (state) {
    case POWER_OFF:
      /* Enable I2C clock */
      RCC->APB1ENR |= i2c->rcc_mask;

      /* Disable I2C peripheral */
      reg->CR1 = 0;

      /* Disable I2C IRQ */
      NVIC_DisableIRQ(i2c->irq_num);

      /* Disable peripheral clock */
      RCC->APB1ENR &= ~i2c->rcc_mask;

      info->status.busy             = 0U;
      info->status.mode             = 0U;
      info->status.direction        = 0U;
      info->status.general_call     = 0U;
      info->status.arbitration_lost = 0U;
      info->status.bus_error        = 0U;

      info->flags &= ~I2C_FLAG_POWER;
      break;

    case POWER_FULL:
      if ((info->flags & I2C_FLAG_INIT) == 0U) {
        return (DRIVER_ERROR);
      }

      if ((info->flags & I2C_FLAG_POWER) != 0U) {
        return (DRIVER_OK);
      }

      /* Enable I2C clock */
      RCC->APB1ENR |= i2c->rcc_mask;

      /* Clear and Enable I2C IRQ */
      NVIC_ClearPendingIRQ(i2c->irq_num);
      NVIC_EnableIRQ(i2c->irq_num);

