koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/I2C_STM32F0xx.c
      /* Reset the peripheral */
      RCC->APB1RSTR |=  i2c->rcc_mask;
      __NOP(); __NOP(); __NOP(); __NOP();
      RCC->APB1RSTR &= ~i2c->rcc_mask;

      /* Initial peripheral setup */
      cr1 = I2C_CR1_SBC    | /* Slave byte control enabled          */
            I2C_CR1_ERRIE  | /* Error interrupts enabled            */
            I2C_CR1_TCIE   | /* Transfer complete interrupt enabled */
            I2C_CR1_STOPIE | /* STOP detection interrupt enabled    */
            I2C_CR1_NACKIE | /* NACK interrupt enabled              */
            I2C_CR1_ADDRIE ; /* Address match interrupt enabled     */

      /* Enable IRQ/DMA rx/tx requests */
      if (i2c->dma_rx == NULL) {
        cr1 |= I2C_CR1_RXIE;
      }
      else {
        cr1 |= I2C_CR1_RXDMAEN;
      }

      if (i2c->dma_tx == NULL) {
        cr1 |= I2C_CR1_TXIE;
      }
      else {
        cr1 |= I2C_CR1_TXDMAEN;
      }

      /* Apply setup and enable peripheral */
      reg->CR1 = cr1 | I2C_CR1_PE;

      /* Ready for operation */
      info->flags |= I2C_FLAG_POWER;
      break;

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @brief       Control I2C Interface.
 * @param[in]   control   Operation
 * @param[in]   arg   Argument of operation (optional)
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2Cx_Control(uint32_t control, uint32_t arg, I2C_RESOURCES *i2c)
{
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *reg = i2c->reg;

  if ((info->flags & I2C_FLAG_POWER) == 0U) {
    /* I2C not powered */
    return (DRIVER_ERROR);
  }

  switch (control) {
    case I2C_OWN_ADDRESS:
      if (arg == 0) {
        /* Disable slave */
        reg->OAR1 = 0;
      }
      else {
        uint32_t val;

        if (arg & I2C_ADDRESS_GC) {
          /* Enable general call */
          reg->CR1 |=  I2C_CR1_GCEN;
        } else {
          /* Disable general call */
          reg->CR1 &= ~I2C_CR1_GCEN;
        }

        if (arg & I2C_ADDRESS_10BIT) {
          val = (arg & 0x3FF ) | I2C_OAR1_OA1MODE;
        } else {
          val = (arg & 0x7F) << 1;
        }

        reg->OAR1 = val | I2C_OAR1_OA1EN;
      }
      break;

    case I2C_BUS_SPEED:
    {
      uint32_t timing = 0;
      uint32_t i2cclk = GetI2CCLK(i2c);
      int32_t presc = ((T_I2CCLK * i2cclk / 1000) - 1);

      if (presc < 0) {
        return (DRIVER_ERROR_UNSUPPORTED);
      }

      switch (arg) {
      case I2C_BUS_SPEED_STANDARD:
        timing = ((presc << 28) | ((STD_MODE_SCLDEL-1) << 20) |
            (STD_MODE_SDADEL << 16) | ((STD_MODE_SCLH-1) << 8) | (STD_MODE_SCLL-1));
        break;
      case I2C_BUS_SPEED_FAST:
        timing = ((presc << 28) | ((FST_MODE_SCLDEL-1) << 20) |
            (FST_MODE_SDADEL << 16) | ((FST_MODE_SCLH-1) << 8) | (FST_MODE_SCLL-1));
        break;
      default:
        return (DRIVER_ERROR_UNSUPPORTED);
      }

      reg->CR1 &= ~I2C_CR1_PE;
      reg->TIMINGR = timing;
      reg->CR1 |= I2C_CR1_PE;

      /* Master configured, clock set */
      info->flags |= I2C_FLAG_SETUP;
    }
    break;

    case I2C_BUS_CLEAR:
      return (DRIVER_ERROR_UNSUPPORTED);

    case I2C_ABORT_TRANSFER:
      return (DRIVER_ERROR_UNSUPPORTED);

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @brief       Start transmitting data as I2C Master.
 * @param[in]   addr          Slave address (7-bit or 10-bit)
 * @param[in]   data          Pointer to buffer with data to transmit to I2C Slave
 * @param[in]   num           Number of data bytes to transmit
 * @param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
 * @param[in]   i2c           Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2Cx_MasterTransmit(uint32_t addr, const uint8_t *data, uint32_t num,
    bool xfer_pending, I2C_RESOURCES *i2c)
{
  uint32_t cr2;
  uint32_t cnt;
  bool restart;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *i2c_reg = i2c->reg;

  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((addr & ~(I2C_ADDRESS_10BIT | I2C_ADDRESS_GC)) > 0x3FFU) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if (!(info->flags & I2C_FLAG_SETUP)) {
    /* Driver not yet configured */
    return (DRIVER_ERROR);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  restart = (info->xfer.ctrl & XFER_CTRL_RESTART) != 0U;

  if (!restart) {
    /* New transfer */
    while (i2c_reg->ISR & I2C_ISR_BUSY) {
      ; /* Wait until bus released */
    }
  }

  info->status.busy             = 1U;
  info->status.mode             = 1U;
  info->status.direction        = 0U;
  info->status.bus_error        = 0U;
  info->status.arbitration_lost = 0U;

  info->xfer.num  = num;
  info->xfer.cnt  = 0;
  info->xfer.data = (uint8_t *)data;
  info->xfer.ctrl = 0U;

  if (xfer_pending) {
    info->xfer.ctrl = XFER_CTRL_RESTART;
  }

  /* Set slave address and transfer direction */
  if (addr & I2C_ADDRESS_10BIT) {
    cr2 = (addr & 0x3FF) | I2C_CR2_ADD10;
  }
  else {
    cr2 = (addr & 0x7F) << 1;
  }

  /* Set number of bytes to transfer */
  if (num < 256) {
    cnt = num;
    /* Send all data bytes and enable automatic STOP */
    if (!xfer_pending && !restart) {
      cr2 |= I2C_CR2_AUTOEND;
    }
  }
  else {
    cnt = 255;
    /* Send 255 data bytes and enable NBYTES reload */
    cr2 |= I2C_CR2_RELOAD;
  }

  /* Apply transfer setup */
  i2c_reg->CR2 = (cnt << 16) | cr2;

  /* Generate start */
  i2c_reg->CR2 |= I2C_CR2_START;
  /* Enable transfer complete interrupt */
  i2c_reg->CR1 |= I2C_CR1_TCIE;

  return (DRIVER_OK);
}

/**
 * @brief                     Start receiving data as I2C Master.
 * @param[in]   addr          Slave address (7-bit or 10-bit)
 * @param[out]  data          Pointer to buffer for data to receive from I2C Slave
 * @param[in]   num           Number of data bytes to receive
 * @param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
 * @param[in]   i2c           Pointer to I2C resources
 * @return                    \ref execution_status
 */
static
int32_t I2Cx_MasterReceive(uint32_t addr, uint8_t *data, uint32_t num,
    bool xfer_pending, I2C_RESOURCES *i2c)
{
  uint32_t cr2;
  uint32_t cnt;
  bool restart;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *i2c_reg = i2c->reg;

