koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/I2C_STM32F0xx.c
        if (xfer->cnt < xfer->num) {
          event |= I2C_EVENT_TRANSFER_INCOMPLETE;
        }

        if (info->status.general_call) {
          event |= I2C_EVENT_GENERAL_CALL;
        }
      }

      xfer->data = NULL;
      xfer->ctrl = 0U;

      info->status.busy = 0U;
      info->status.mode = 0U;
    }
    else if (isr & I2C_ISR_ADDR) {
      /* Address matched (slave mode) */
      icr |= I2C_ICR_ADDRCF;

      info->status.mode = 0U;

      if ((isr & I2C_ISR_ADDCODE) == 0) {
        /* General call */
        info->status.general_call = 1U;

        event = I2C_EVENT_GENERAL_CALL;
      }

      /* Set transfer direction */
      if ((isr & I2C_ISR_DIR) == 0U) {
        info->status.direction = 1U; /* Slave enters receiver mode */

        event |= I2C_EVENT_SLAVE_RECEIVE;
      }
      else {
        info->status.direction = 0U; /* Slave enters transmitter mode */

        event |= I2C_EVENT_SLAVE_TRANSMIT;
      }

      if ((xfer->data == NULL) || (info->status.general_call != 0U)) {
        if (info->cb_event != NULL) {
          info->cb_event(event);
        }
        event = 0U;
      }

      info->status.busy  = 1U;
      xfer->cnt = 0;
      xfer->ctrl |= XFER_CTRL_ADDR_DONE;
    }
    else if (isr & I2C_ISR_NACKF) {
      /* NACK received */
      icr |= I2C_ICR_NACKCF;

      /* Master sends STOP after slave NACK */
      /* Slave already released the lines   */
      if (info->status.mode) {
        if (xfer->cnt == 0) {
          xfer->ctrl |= XFER_CTRL_ADDR_NACK;
        }
        else {
          xfer->cnt--;

          if ((isr & I2C_ISR_TXE) == 0U) {
            reg->ISR = I2C_ISR_TXE;
            xfer->cnt--;
          }
        }
      }
    }
    else if (isr & I2C_ISR_ARLO) {
      /* Arbitration lost */
      icr |= I2C_ICR_ARLOCF;

      /* Switch to slave mode */
      info->status.busy             = 0U;
      info->status.mode             = 0U;
      info->status.arbitration_lost = 1U;

      xfer->data = NULL;
      xfer->ctrl = 0U;

      event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_ARBITRATION_LOST;
    }
    else if (isr & I2C_ISR_BERR) {
      /* Bus error (misplaced start/stop) */
      icr |= I2C_ICR_BERRCF;

      info->status.bus_error = 1U;

      if (info->status.mode == 0U) {
        /* Lines are released in slave mode */
        info->status.busy = 0U;

        xfer->data = NULL;
        xfer->ctrl = 0U;
      }

      event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_BUS_ERROR;
    }

    /* Clear status flags */
    reg->ICR = icr;
  }

  /* Send events */
  if ((event) && (info->cb_event)) {
    info->cb_event(event);
  }
}

#if defined(USE_I2C1)
/* I2C1 Driver wrapper functions */
/**
 *
 * @param cb_event
 * @return
 */
static
int32_t I2C1_Initialize(I2C_SignalEvent_t cb_event)
{
  return (I2Cx_Initialize(cb_event, &I2C1_Resources));
}

/**
 *
 * @return
 */
static
int32_t I2C1_Uninitialize(void)
{
  return (I2Cx_Uninitialize(&I2C1_Resources));
}

/**
 *
 * @param state
 * @return
 */
static
int32_t I2C1_PowerControl(POWER_STATE state)
{
  return (I2Cx_PowerControl(state, &I2C1_Resources));
}

/**
 *
 * @param addr
 * @param data
 * @param num
 * @param xfer_pending
 * @return
 */
static
int32_t I2C1_MasterTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
  return (I2Cx_MasterTransmit(addr, data, num, xfer_pending, &I2C1_Resources));
}

/**
 *
 * @param addr
 * @param data
 * @param num
 * @param xfer_pending
 * @return
 */
static
int32_t I2C1_MasterReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
  return (I2Cx_MasterReceive(addr, data, num, xfer_pending, &I2C1_Resources));
}

/**
 *
 * @param data
 * @param num
 * @return
 */
static
int32_t I2C1_SlaveTransmit(const uint8_t *data, uint32_t num)
{
  return (I2Cx_SlaveTransmit(data, num, &I2C1_Resources));
}

/**
 *
 * @param data
 * @param num
 * @return
 */
static
int32_t I2C1_SlaveReceive(uint8_t *data, uint32_t num)
{
  return (I2Cx_SlaveReceive(data, num, &I2C1_Resources));
}

/**
 *
 * @return
 */
static
int32_t I2C1_GetDataCount(void)
{
  return (I2Cx_GetDataCount(&I2C1_Resources));
}

/**
 *
 * @param control
 * @param arg
 * @return
 */
static
int32_t I2C1_Control(uint32_t control, uint32_t arg)
{
  return (I2Cx_Control(control, arg, &I2C1_Resources));
}

/**
 *
 * @return
 */
static
I2C_STATUS I2C1_GetStatus(void)
{
  return (I2Cx_GetStatus(&I2C1_Resources));
}

/**
 *
 */
void I2C1_IRQHandler(void)
{
  I2Cx_IRQHandler(&I2C1_Resources);
}
#endif  /* USE_I2C1 */

#if defined(USE_I2C2)
/* I2C2 Driver wrapper functions */
/**
 *
 * @param cb_event
 * @return
 */
static
int32_t I2C2_Initialize(I2C_SignalEvent_t cb_event)
{
  return (I2Cx_Initialize(cb_event, &I2C2_Resources));
}

/**
 *
 * @return
 */
static
int32_t I2C2_Uninitialize(void)
{
  return (I2Cx_Uninitialize(&I2C2_Resources));
}

/**
 *
 * @param state
 * @return
 */
static
int32_t I2C2_PowerControl(POWER_STATE state)
{
  return (I2Cx_PowerControl(state, &I2C2_Resources));
}

/**
 *
 * @param addr
 * @param data
 * @param num
 * @param xfer_pending
 * @return
 */
static
int32_t I2C2_MasterTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
  return (I2Cx_MasterTransmit(addr, data, num, xfer_pending, &I2C2_Resources));
}

/**
 *
 * @param addr
 * @param data
 * @param num
 * @param xfer_pending
 * @return
 */
static
int32_t I2C2_MasterReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
  return (I2Cx_MasterReceive(addr, data, num, xfer_pending, &I2C2_Resources));
}

/**
 *
 * @param data
 * @param num
 * @return
 */
static
int32_t I2C2_SlaveTransmit(const uint8_t *data, uint32_t num)
{
  return (I2Cx_SlaveTransmit(data, num, &I2C2_Resources));
}

/**
 *
 * @param data
 * @param num
 * @return
 */
static
int32_t I2C2_SlaveReceive(uint8_t *data, uint32_t num)
{
  return (I2Cx_SlaveReceive(data, num, &I2C2_Resources));
}

/**
 *
 * @return
 */
static
int32_t I2C2_GetDataCount(void)
{
  return (I2Cx_GetDataCount(&I2C2_Resources));
}

/**
 *
 * @param control
 * @param arg
 * @return
 */
static
int32_t I2C2_Control(uint32_t control, uint32_t arg)
{
  return (I2Cx_Control(control, arg, &I2C2_Resources));
}

/**
 *
 * @return
 */
static
I2C_STATUS I2C2_GetStatus(void)
{
  return (I2Cx_GetStatus(&I2C2_Resources));
}

/**
 *
 */
void I2C2_IRQHandler(void)
{
  I2Cx_IRQHandler(&I2C2_Resources);
}
#endif

/*******************************************************************************
 *  global variable definitions  (scope: module-exported)
 ******************************************************************************/

#if defined(USE_I2C1)
/* I2C1 Driver Control Block */
DRIVER_I2C Driver_I2C1 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C1_Initialize,
  I2C1_Uninitialize,
  I2C1_PowerControl,
  I2C1_MasterTransmit,
  I2C1_MasterReceive,
  I2C1_SlaveTransmit,
  I2C1_SlaveReceive,
  I2C1_GetDataCount,
  I2C1_Control,
  I2C1_GetStatus
};
#endif  /* USE_I2C1 */

#if defined(USE_I2C2)
/* I2C1 Driver Control Block */
DRIVER_I2C Driver_I2C2 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C2_Initialize,
  I2C2_Uninitialize,
  I2C2_PowerControl,
  I2C2_MasterTransmit,
  I2C2_MasterReceive,
  I2C2_SlaveTransmit,
  I2C2_SlaveReceive,
  I2C2_GetDataCount,
  I2C2_Control,
  I2C2_GetStatus
};
#endif

#endif /* defined(USE_I2C1) || defined(USE_I2C2) */
